---
kind: property
id: P:Autodesk.Revit.DB.PrintParameters.PaperPlacement
source: html/43c1cf71-3077-f72b-425a-f3e6173d2953.htm
---
# Autodesk.Revit.DB.PrintParameters.PaperPlacement Property

The paper placement type.

## Syntax (C#)
```csharp
public PaperPlacementType PaperPlacement { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - Thrown when the input argument is out of range.